import i18n from 'i18next';
import I18nextBrowserLanguageDetector from "i18next-browser-languagedetector";
import { initReactI18next } from 'react-i18next';

i18n.use(I18nextBrowserLanguageDetector).use(initReactI18next).init({
    debug: true,
    fallbacklng: "en",
    resources: {
        en:{
            translation: {
                greeting: "Good Morning",
                description:"Education plays a crucial role in our lives. It not only provides us with knowledge but also develops our personality. Through education, we learn new things and improve our lives. It is essential for our social, economic, and cultural development. An educated person can better understand their rights and responsibilities and bring about positive change in society. Education is a powerful means to reduce poverty and bring equality in society. Therefore, everyone should have the opportunity to receive an education. It is the foundation for a better and more prosperous future for all.",
                ourCampus:" Bharathi School is situated on a 5-acre campus on Thadagam Road in close proximity to the popular residential areas viz., Saibaba Colony, R. S. Puram and Sivananda Colony. The school houses the best infrastructure facilities, including an auditorium with leading-edge technology to accommodate a seating capacity of 500, an air-conditioned multi-purpose hall with a capacity of 300 seats, an open-air stage, A vast playground to cater to the needs of athletes, and sportspersons, basketball court with floodlights, kids play zone for kindergarten students, extensively stocked library with age-appropriate books on various genres, spacious and well-lit and well-ventilated classrooms with comfortable furniture, well-equipped Science laboratories and exclusive Computer labs."
            }
        },
        hi:{
            translation: {
                greeting: "सुप्रभात (Suprabhat)",
                description:"शिक्षा हमारे जीवन में एक महत्वपूर्ण भूमिका निभाती है। यह न केवल हमें ज्ञान प्रदान करती है बल्कि हमारे व्यक्तित्व का विकास भी करती है। शिक्षा के माध्यम से हम नयी चीज़ें सीखते हैं और अपने जीवन को सुधारते हैं। यह हमारे सामाजिक, आर्थिक और सांस्कृतिक विकास के लिए आवश्यक है। शिक्षित व्यक्ति अपने अधिकारों और कर्तव्यों को बेहतर समझ सकता है और समाज में एक सकारात्मक बदलाव ला सकता है। शिक्षा गरीबी को कम करने और समाज में समानता लाने का एक सशक्त माध्यम है। इसलिए, हर किसी को शिक्षा प्राप्त करने का अवसर मिलना चाहिए।",
                ourCampus:"भारती स्कूल थडगम रोड पर 5 एकड़ के परिसर में स्थित है, जो लोकप्रिय आवासीय क्षेत्रों जैसे साईबाबा कॉलोनी, आर. एस. पुरम और शिवानंद कॉलोनी के निकट है। स्कूल में सर्वश्रेष्ठ अवसंरचना सुविधाएं हैं, जिनमें 500 लोगों की बैठने की क्षमता वाला अत्याधुनिक तकनीक से सुसज्जित एक सभागार, 300 सीटों की क्षमता वाला एक वातानुकूलित बहुउद्देशीय हॉल, एक ओपन-एयर मंच, एथलीटों और खिलाड़ियों की आवश्यकताओं को पूरा करने के लिए एक विशाल खेल का मैदान, फ्लडलाइट्स के साथ बास्केटबॉल कोर्ट, किंडरगार्टन छात्रों के लिए बच्चों का खेल क्षेत्र, विभिन्न शैलियों की आयु-उपयुक्त पुस्तकों के साथ व्यापक रूप से स्टॉक की गई लाइब्रेरी, आरामदायक फर्नीचर के साथ विशाल और अच्छी तरह से रोशनी और हवादार कक्षाएं, सुसज्जित विज्ञान प्रयोगशालाएं और विशेष कंप्यूटर लैब्स शामिल हैं।"
            }
        },
        ta:{
            translation: {
                greeting: "காலை வாழ்த்துக்கள் (Kaalai Vathukal)",
                description:"கல்வி நம் வாழ்வில் முக்கியமான பங்கை வகிக்கின்றது. இது நமக்கு அறிவை வழங்குவதோடு மட்டுமல்லாமல், நம் ஆளுமையை மேம்படுத்துகின்றது. கல்வியின் மூலம் நாம் புதிய விடயங்களை கற்றுக் கொள்கிறோம் மற்றும் நம் வாழ்க்கையை மேம்படுத்துகிறோம். சமூக, பொருளாதார மற்றும் பண்பாட்டுக் கட்டமைப்புகளை மேம்படுத்தவும் இது அவசியம். கல்வியறிஞர் தனது உரிமைகளையும் கடமைகளையும் தெளிவாக அறிந்து, சமூகத்தில் நல்ல மாற்றத்தை ஏற்படுத்த முடியும். கல்வி வறுமையை குறைக்கவும் சமுதாயத்தில் சமத்துவத்தை கொண்டுவரவும் உதவுகின்றது. எனவே, அனைவருக்கும் கல்வி பெறுவதற்கான வாய்ப்பு கிடைக்க வேண்டும்.",
                ourCampus:"பாரதி பள்ளி ததகம் சாலையில் 5 ஏக்கர் பரப்பளவில் அமைந்துள்ளது, சாய்பாபா காலனி, ஆர்.எஸ்.புரம் மற்றும் சிவானந்தா காலனி போன்ற பிரபல குடியிருப்புப் பகுதிகளுக்கு அருகில் உள்ளது. பள்ளியில் சிறந்த அடிக்கோள सुविधைகள் உள்ளன, 500 பேர் அமரக்கூடிய திறன் கொண்ட ஒரு முன்னணி தொழில்நுட்பத்துடன் கூடிய மண்டபம், 300 இருக்கைகள் கொண்ட ஒரு குளிர்சாதன மண்டபம், ஒரு திறந்தநிலை மேடை, வீரர்களின் தேவைகளை பூர்த்தி செய்ய ஒரு விசாலமான விளையாட்டு மைதானம், பாஸ்கெட்ட்பால் மைதானம், குழந்தைகள் விளையாட்டு பகுதி, பல்வேறு வகையான வயதுக்கு ஏற்ப பொருந்தக்கூடிய புத்தகங்களுடன் உள்ள நூலகம், வசதியான மரச்சாமான்களுடன் உள்ள விசாலமான மற்றும் நன்றாக ஒளிபரப்பப்பட்ட வகுப்பறைகள், நன்கு இயங்கக்கூடிய அறிவியல் ஆய்வகங்கள் மற்றும் தனித்துவமான கணினி ஆய்வகங்கள் அடங்கும்."
            }
        },
        ur:{
            translation: {
                greeting: "صبح بخیر (Subah Bakhair)",
                description:"تعلیم ہماری زندگی میں ایک اہم کردار ادا کرتی ہے۔ یہ نہ صرف ہمیں علم فراہم کرتی ہے بلکہ ہماری شخصیت کی ترقی بھی کرتی ہے۔ تعلیم کے ذریعے ہم نئی چیزیں سیکھتے ہیں اور اپنی زندگی کو بہتر بناتے ہیں۔ یہ ہمارے سماجی، معاشی اور ثقافتی ترقی کے لئے ضروری ہے۔ تعلیم یافتہ شخص اپنے حقوق اور فرائض کو بہتر سمجھ سکتا ہے اور معاشرے میں مثبت تبدیلی لا سکتا ہے۔ تعلیم غربت کو کم کرنے اور معاشرے میں مساوات لانے کا ایک مضبوط ذریعہ ہے۔ لہذا، ہر کسی کو تعلیم حاصل کرنے کا موقع ملنا چاہئے۔",
                ourCampus:"ھارتی اسکول تھاڈگم روڈ پر 5 ایکڑ کے کیمپس پر واقع ہے، جو مشہور رہائشی علاقوں جیسے سائی بابا کالونی، آر ایس پورم اور شیوانندا کالونی کے قریب ہے۔ اسکول میں بہترین انفراسٹرکچر کی سہولیات موجود ہیں، جن میں 500 افراد کی گنجائش والا ایک جدید ٹیکنالوجی سے آراستہ آڈیٹوریم، 300 نشستوں کی گنجائش والا ایک ائیر کنڈیشنڈ ملٹی پرپز ہال، ایک اوپن ایئر سٹیج، کھلاڑیوں اور اسپورٹس پرسنز کی ضروریات کو پورا کرنے کے لئے ایک وسیع کھیل کا میدان، فلڈ لائٹس کے ساتھ باسکٹ بال کورٹ، کنڈرگارٹن طلباء کے لئے بچوں کا کھیل کا علاقہ، مختلف موضوعات پر عمر کے مطابق کتابوں کے ساتھ مکمل طور پر اسٹاک کی گئی لائبریری، آرام دہ فرنیچر کے ساتھ وسیع اور روشن اور ہوا دار کلاس رومز، مکمل طور پر لیس سائنس لیبارٹریز اور مخصوص کمپیوٹر لیبز شامل ہیں۔"
            }
        },
        ar:{
            translation: {
                greeting: "صباح الخير (Sabah Alkhair)",
                description:"يلعب التعليم دورًا مهمًا في حياتنا. إنه لا يوفر لنا المعرفة فحسب، بل يطور شخصيتنا أيضًا. من خلال التعليم، نتعلم أشياء جديدة ونحسن حياتنا. إنه ضروري لتنمية اجتماعية واقتصادية وثقافية. يمكن للشخص المتعلم أن يفهم حقوقه وواجباته بشكل أفضل ويمكن أن يجلب تغييرًا إيجابيًا في المجتمع. التعليم هو وسيلة قوية للحد من الفقر وجلب المساواة في المجتمع. لذلك، يجب أن يحصل الجميع على فرصة للحصول على التعليم.",
                ourCampus:"تقع مدرسة بهاراتي في حرم جامعي بمساحة 5 أفدنة على طريق ثاداجام بالقرب من المناطق السكنية الشهيرة مثل مستعمرة ساي بابا، ومستعمرة آر. إس. بورام، ومستعمرة سيفاناندا. تحتوي المدرسة على أفضل المرافق والبنية التحتية، بما في ذلك مدرج مزود بتكنولوجيا متقدمة ويتسع لـ 500 مقعد، وقاعة متعددة الأغراض مكيفة الهواء بسعة 300 مقعد، ومنصة في الهواء الطلق، وملعب واسع لتلبية احتياجات الرياضيين، وملعب كرة سلة مزود بالأضواء الكاشفة، ومنطقة لعب للأطفال لطلاب الروضة، ومكتبة تحتوي على كتب مناسبة لأعمارهم في مختلف المجالات، وفصول دراسية واسعة ومضاءة جيدًا وجيدة التهوية مزودة بأثاث مريح، ومختبرات علوم مجهزة تجهيزًا جيدًا، ومختبرات حاسوب حصرية."
            }
        }
    }
});

export default i18n;
